# AnalyticalOpening Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalOpening Class
Members See Also
---
An element that represents an Opening in an Analytical Panel element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AnalyticalOpening : AnalyticalSurfaceBase
```

Visual Basic
---
```text
Public Class AnalyticalOpening _
	Inherits AnalyticalSurfaceBase
```

Visual C++
---
```text
public ref class AnalyticalOpening : public AnalyticalSurfaceBase
```

# Remarks
It can cut only one Analytical Panel at a time.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..AnalyticalElement Autodesk.Revit.DB.Structure..::..AnalyticalSurfaceBase Autodesk.Revit.DB.Structure..::..AnalyticalOpening
# See Also
AnalyticalOpening Members
Autodesk.Revit.DB.Structure Namespace